## CHAPTER 5
# Getting Started with pandas
---
## MultiIndex

In [1]:
%pylab inline

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
plt.style.use('ggplot')

Populating the interactive namespace from numpy and matplotlib

In [5]:
data = pd.Series(np.random.randn(10),
    index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
           [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
display(data, data.index)

a  1    0.405618
   2    1.930470
   3   -1.222861
b  1    0.709752
   2   -1.985594
   3    0.052478
c  1    0.495190
   2    0.967414
d  2   -0.776307
   3    0.559881
dtype: float64

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [15]:
display(data['b'], data[1], data['a',3], data.loc[['a','c'],2], data['b':'c'], data[:,2])

1    0.709752
2   -1.985594
3    0.052478
dtype: float64

1.9304695919646064

-1.2228605399752783

a  2    1.930470
c  2    0.967414
dtype: float64

b  1    0.709752
   2   -1.985594
   3    0.052478
c  1    0.495190
   2    0.967414
dtype: float64

a    1.930470
b   -1.985594
c    0.967414
d   -0.776307
dtype: float64

In [17]:
data.reset_index() # drop=True

  level_0  level_1         0
0       a        1  0.405618
1       a        2  1.930470
2       a        3 -1.222861
3       b        1  0.709752
4       b        2 -1.985594
5       b        3  0.052478
6       c        1  0.495190
7       c        2  0.967414
8       d        2 -0.776307
9       d        3  0.559881

In [20]:
data.unstack()

          1         2         3
a  0.405618  1.930470 -1.222861
b  0.709752 -1.985594  0.052478
c  0.495190  0.967414       NaN
d       NaN -0.776307  0.559881

In [21]:
data.unstack().unstack()

1  a    0.405618
   b    0.709752
   c    0.495190
   d         NaN
2  a    1.930470
   b   -1.985594
   c    0.967414
   d   -0.776307
3  a   -1.222861
   b    0.052478
   c         NaN
   d    0.559881
dtype: float64

In [24]:
data.unstack(level=0)

          a         b         c         d
1  0.405618  0.709752  0.495190       NaN
2  1.930470 -1.985594  0.967414 -0.776307
3 -1.222861  0.052478       NaN  0.559881

In [25]:
data.unstack(level=1)

          1         2         3
a  0.405618  1.930470 -1.222861
b  0.709752 -1.985594  0.052478
c  0.495190  0.967414       NaN
d       NaN -0.776307  0.559881

In [30]:
data.unstack().reset_index(drop=True)

          1         2         3
0  0.405618  1.930470 -1.222861
1  0.709752 -1.985594  0.052478
2  0.495190  0.967414       NaN
3       NaN -0.776307  0.559881

In [32]:
data.index.names=['key1','key2']
data.unstack()

key2         1         2         3
key1
a     0.405618  1.930470 -1.222861
b     0.709752 -1.985594  0.052478
c     0.495190  0.967414       NaN
d          NaN -0.776307  0.559881

In [39]:
data2 = data.swaplevel('key1','key2') # swaplevel(0,1)
display(data, data2, data2[2])

key1  key2
a     1       0.405618
      2       1.930470
      3      -1.222861
b     1       0.709752
      2      -1.985594
      3       0.052478
c     1       0.495190
      2       0.967414
d     2      -0.776307
      3       0.559881
dtype: float64

key2  key1
1     a       0.405618
2     a       1.930470
3     a      -1.222861
1     b       0.709752
2     b      -1.985594
3     b       0.052478
1     c       0.495190
2     c       0.967414
      d      -0.776307
3     d       0.559881
dtype: float64

key1
a    1.930470
b   -1.985594
c    0.967414
d   -0.776307
dtype: float64

In [45]:
data.sortlevel('key2') # sortlevel(1)
data.sort_index(level=1) # data.sort_values()

C:\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level=...)
  if __name__ == '__main__':

key1  key2
a     1       0.405618
b     1       0.709752
c     1       0.495190
a     2       1.930470
b     2      -1.985594
c     2       0.967414
d     2      -0.776307
a     3      -1.222861
b     3       0.052478
d     3       0.559881
dtype: float64

In [48]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
    columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])
display(frame)
frame.sum(level=0)
frame.sum(level=1,axis=1)

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

     Green  Red
a 1      2    1
  2      8    4
b 1     14    7
  2     20   10

In [61]:
frame.reset_index(col_level=1)

                   Ohio     Colorado
  level_0 level_1 Green Red    Green
0       a       1     0   1        2
1       a       2     3   4        5
2       b       1     6   7        8
3       b       2     9  10       11

In [63]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd': [0, 1, 2, 0, 1, 2, 3]})
display(frame)

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [71]:
frame.set_index(['c','d'])
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [76]:
frame.set_index(['c','d']).reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [78]:
frame.drop(['c','d'],axis=1)

   a  b
0  0  7
1  1  6
2  2  5
3  3  4
4  4  3
5  5  2
6  6  1